In [1]:
import numpy as np

In [3]:
# np.random.seed()

a=np.random.randint(1,20,5)
a

array([ 6,  2,  5,  2, 18])

In [5]:
np.random.seed(5)

a=np.random.randint(1,20,5)
a

array([ 4, 15, 16,  7, 17])

# Pandas

In [6]:
# open source library used to handle data manipulations
'''
Data Structure of pandas :
1. Series ==> used for 1-D data . It shows only values of a column and it will not include column name.

2. DataFrame ==> It is multidimensional data . It shows column names with values 

'''

'\nData Structure of pandas :\n1. Series ==> used for 1-D data . It shows only values of a column and it will not include column name.\n\n2. DataFrame ==> It is multidimensional data . It shows column names with values \n\n'

In [7]:
import pandas as pd

In [8]:
a=pd.Series([1,34,78,90])
a

0     1
1    34
2    78
3    90
dtype: int64

In [9]:
type(a)

pandas.core.series.Series

In [10]:
# Data Frame

In [11]:
a={
    "Emp_ID" : [1,2,3,4,5,6,7,8],
    "Name" : ["Sam","Rahul","Gorav","Aniket","Anjali","Ria","Muskan","Harsh"],
    "Dept." : ["IT","HR","Sales","IT","IT","Sales","IT","HR"],
    "Salary" : [25000,28000,23000,30000,35000,32000,28000,27000],
    "Working_Hours":[8,7,6,9,7,8,9,7]
}

In [12]:
a

{'Emp_ID': [1, 2, 3, 4, 5, 6, 7, 8],
 'Name': ['Sam',
  'Rahul',
  'Gorav',
  'Aniket',
  'Anjali',
  'Ria',
  'Muskan',
  'Harsh'],
 'Dept.': ['IT', 'HR', 'Sales', 'IT', 'IT', 'Sales', 'IT', 'HR'],
 'Salary': [25000, 28000, 23000, 30000, 35000, 32000, 28000, 27000],
 'Working_Hours': [8, 7, 6, 9, 7, 8, 9, 7]}

In [13]:
df = pd.DataFrame(a)
df

   Emp_ID    Name  Dept.  Salary  Working_Hours
0       1     Sam     IT   25000              8
1       2   Rahul     HR   28000              7
2       3   Gorav  Sales   23000              6
3       4  Aniket     IT   30000              9
4       5  Anjali     IT   35000              7
5       6     Ria  Sales   32000              8
6       7  Muskan     IT   28000              9
7       8   Harsh     HR   27000              7

In [14]:
# how to check top 5 data from dataframe

In [16]:
df.head()  # --> by default gives top 5 lines

   Emp_ID    Name  Dept.  Salary  Working_Hours
0       1     Sam     IT   25000              8
1       2   Rahul     HR   28000              7
2       3   Gorav  Sales   23000              6
3       4  Aniket     IT   30000              9
4       5  Anjali     IT   35000              7

In [18]:
df.head(3)

   Emp_ID   Name  Dept.  Salary  Working_Hours
0       1    Sam     IT   25000              8
1       2  Rahul     HR   28000              7
2       3  Gorav  Sales   23000              6

In [19]:
# how to check bottom data

In [20]:
df.tail() # --> by default give last 5 lines

   Emp_ID    Name  Dept.  Salary  Working_Hours
3       4  Aniket     IT   30000              9
4       5  Anjali     IT   35000              7
5       6     Ria  Sales   32000              8
6       7  Muskan     IT   28000              9
7       8   Harsh     HR   27000              7

In [21]:
df.tail(2)

   Emp_ID    Name Dept.  Salary  Working_Hours
6       7  Muskan    IT   28000              9
7       8   Harsh    HR   27000              7

In [22]:
# How can we check random indexed data

In [24]:
df.sample(3)

   Emp_ID    Name  Dept.  Salary  Working_Hours
2       3   Gorav  Sales   23000              6
5       6     Ria  Sales   32000              8
6       7  Muskan     IT   28000              9

In [ ]:
# How to export our data

In [26]:
df.to_csv("C:\\Users\\DELL\\OneDrive\\Desktop\\Regex\\New folder\\Emp_Info.csv")

In [ ]:
# step 1  --> df.to_csv(" ")
# step 2 --> Create a new folder ==> copy location ==> paste it into step 1
# df.to_csv("Folder_location\\filename.csv")